export const mock = {
  "Web-приложение":
    "клиент-серверное приложение, в котором клиент взаимодействует с веб-сервером при помощи браузера. Логика веб-приложения распределена между сервером и клиентом, хранение данных осуществляется, преимущественно, на сервере, обмен информацией происходит по сети.",
  Архитектура:
    "совокупность программных и аппаратных средств, составляющая информационную систему организации и включающая, в частности, базы данных и промежуточное программное обеспечение ",
  "Шаблон проектирования или паттерн":
    "повторяемая архитектурная конструкция, представляющая собой решение проблемы проектирования в рамках некоторого часто возникающего контекста ",
  "Язык программирования":
    "формальный язык, содержащий набор инструкций, которые производят различные виды выходных данных. Языки программирования используются в компьютерном программировании для реализации алгоритмов",
  "Back-end ":
    "программно-аппаратная часть сервиса. Это набор средств, с помощью которых происходит реализация логики веб-сайта. Это то, что скрыто от наших глаз, т. е. происходит вне компьютера и браузера ",
  Frontend:
    "презентационная часть информационной или программной системы, её пользовательский интерфейс и связанные с ним компоненты; применяется в соотношении с базисной частью системы, её внутренней реализацией, называемой в этом случае бэкендом",
  Ajax: "асинхронный JavaScript и XML подход к построению интерактивных пользовательских интерфейсов веб-приложений, заключающийся в «фоновом» обмене данными браузера с веб-сервером",
  SSR: "это метод отрисовки веб-страницы на сервере, а не в браузере. Чтобы пользователь не смотрел на пустую страницу, ожидая, пока загрузится веб-приложение, файлы JavaScript или CSS, сервер отдаёт ему сгенерированный HTML. Пользователь получает страницу и просматривает её, пока основное приложение загружается и запускается",
  CSR: "При клиентском рендеринге (CSR) сервер отображает только базовый HTML-контейнер страницы. Логика, выборка данных, шаблоны и маршрутизация, необходимые для отображения контента на странице, обрабатываются кодом JavaScript, который выполняется в браузере/клиенте. CSR стал популярным как метод создания одностраничных приложений. Это помогло стереть разницу между веб-сайтами и установленными приложениями",
  SPA: "это реализация веб-приложения, которая загружает только один веб-документ, а затем обновляет содержимое тела этого единственного документа с помощью API-интерфейсов JavaScript, таких как Fetch, когда необходимо отобразить другой контент",
  React:
    "Библиотека для веб- и собственных пользовательских интерфейсов. React позволяет создавать пользовательские интерфейсы из отдельных частей, называемых компонентами",
  "Next.js":
    "фреймворк на основе React, позволяет создавать полнофункциональные веб-приложения за счет расширения новейших функций React и интеграции мощных инструментов JavaScript на основе Rust для максимально быстрой сборки",
  SSG: "если страница использует статическую генерацию, HTML-код страницы генерируется во время сборки . Это означает, что в рабочей среде HTML-код страницы генерируется при запуске билда. Этот HTML-код затем будет повторно использоваться при каждом запросе. Он может быть кэширован CDN",
  SEO: "это технология раскрутки сайта в поисковой выдаче с целью получения трафика. В основе работы лежит знание алгоритмов ранжирования ресурсов в выдаче и улучшение критериев сайта с целью выведения его в топ результатов поиска по требуемым ключевым фразам",
  "Node.js":
    "это среда выполнения кода JavaScript вне браузера, которая позволяет писать серверный код для веб-страниц и веб-приложений, а также для программ командной строки. Node. js — не отдельный язык программирования, а платформа для использования JavaScript на стороне сервера",
};
